insert into role(name)
values ('ADMIN'),  -- all functions?
       ('SCIENTIST'),
       ('MANAGER'),
       ('RESERVE_WORKER');

insert into "user"(username, password_hash)
values ('Mondayish', 'password_hash'),
       ('Darklol', 'password_hash'),
       ('Okarin', 'password_hash'),
       ('Kuristina', 'password_hash'),
       ('Vasyan', 'password_hash'),
       ('Vovan', 'password_hash'),
       ('Stasyan', 'password_hash'),
       ('Oleg', 'password_hash'),
       ('Arnold Schwarzenegger', 'password_hash'),
       ('Sam Stone', 'password_hash'),
       ('Keanu Reeves', 'password_hash'),
       ('Kamenshik', 'password_hash'),
       ('Courier 6', 'password_hash'),
       ('Dragonborn', 'password_hash'),
       ('Shrek', 'password_hash'),
       ('Doomguy', 'password_hash'),
       ('Homer', 'password_hash'),
       ('Ajax', 'password_hash'),
       ('Admin', '$2a$12$sFgkEswxPaTQHc1SfaexQeuL8kgJfgvyTKN5Ckaq/SS7xVzMeJ7FO');


insert into user_role(user_id, role_id)
values (1,1),
       (2,1),
       (1,2),
       (2,2),
       (3,2),
       (4,2),
       (5,3),
       (6,3),
       (7,3),
       (8,3),
       (9,3),
       (10,3),
       (11,3),
       (12,4),
       (13,4),
       (14,4),
       (15,4),
       (16,4),
       (17,4),
       (18,4),
       (19,1);


insert into status(name)
values ('SUCCESS'),
       ('FAILURE'),
       ('MUTATION');

insert into characteristic(name, description, coefficient)
values              /* Размеры */
       /* 1 */('Очень большой размер', 'Животное обладает выдающимися размерами тела', 5),
       /* 2 */('Большой размер', 'Животное обладает крупным размером тела', 3),
       /* 3 */('Средний размер', 'Животное обладает средним телосложением', 0),
       /* 4 */('Маленький размер', 'Животное обладает небольшим размером тела', -3),
       /* 5 */('Очень маленький размер', 'Животное обладает совсем крохотным телосложением', -4),
                    /* Покров */
       /* 6 */('Густой мех', 'Животное покрыто густым волосяным покровом', 4),
       /* 7 */('Хитин', 'Жавотное облачено в твёрдую хитиновую оболочку', 0),
       /* 8 */('Лысина', 'Кожа животного практически ничем не покрыта', -6),
       /* 9 */('Оперение', 'Животное покрыто перьями', 0),
       /* 10 */('Чешуя', 'Покров животного состоит из чешуек', 2),
                    /* Мясо */
       /* 11 */('Толстая кожа', 'У животного толстый кожный покров', -6),
       /* 12 */('Подкожный жировой слой', 'Животное имеет солидные жировые отражение по всему телу', 4),
                    /* Питание */
       /* 13 */('Плотоядное', 'Животное преимущественно питается пищей животного происхождения', -1),
       /* 14 */('Травоядное', 'Животное преимущественно питается пищей растительного происхождения', 1),
       /* 15 */('Всеядное', 'Рацион животного состоит из пищи как животного, так и растительного происхождения', 2),
                    /* Зрение */
       /* 16 */('Ночное зрение', 'Животное хорошо видит в темноте', 3),
       /* 17 */('Слепота', 'Животное практически ничего не видит', -3),
                    /* Остальное */
       /* 18 */('Хороший слух', 'Животное способно тонко различать звуки', 2),
       /* 19 */('Тонкое обоняние', 'Животное способно отлично различать запахи', 2),
       /* 20 */('Панцирь', 'Животное имеет твёрдую костную оболочку', -5),
                    /* Съедобность */
       /* 21 */('Съедобное мясо', 'Мясо животного можно применять в пищу', 2),
       /* 22 */('Несъедобное мясо', 'Мясо животного лучше не употреблять в пищу', -6),
       /* 23 */('Вкусное мясо', 'Мясо животного является деликатесом', 4),
       /* 24 */('Много мяса', 'Животное можно использовать для производства пищи', 3),
       /* 25 */('Мало мяса', 'Мясо животного слишком мало для производства пищи', -3),
                    /* Чистоплотность */
       /* 26 */('Грязное', 'Животное не отличается чистоплотностью', -4),
       /* 27 */('Чистоплотное', 'Животное уделяет особое внимание своей чистоте', 4),
                    /* Характер */
       /* 28 */('Приручаемое', 'Животное можно выращивать в хозяйстве', 2),
       /* 29 */('Неприручаемое', 'Животное трудно выращивать в хозяйстве', -8),
       /* 30 */('Дрессируемое', 'Животное можно обучить для помощи человеку', 1),
       /* 31 */('Домашнее', 'Животное можно держать в доме', 2),
       /* 32 */('Агрессивное', 'Животное обладает крайне неприятным нравом', -6),
       /* 33 */('Пугливое', 'Животное боится человека', -2),
       /* 34 */('Спокойное', 'Животное спокойно реагирует на человека', 1),
       /* 35 */('Привязанность', 'Животное способно эмоционально привязаться к человеку', 3),
       /* 36 */('Ядовитое', 'Животное способно навредить человеку своим ядом', -7),
       /* 37 */('Летает', 'Животное умеет летать', 0),
       /* 38 */('Плавает', 'Животное умеет плавать', 0),
       /* 39 */('Интеллект', 'Животное обладает повышенным интеллектом', 4);

insert into characteristic_in_conflict
values (1,2),
       (1,3),
       (1,4),
       (1,5),
       (2,3),
       (2,4),
       (2,5),
       (3,4),
       (3,5),
       (4,5),   /* размеры конфликтуют между собой */
       (6,7),
       (6,8),
       (6,9),
       (6,10),
       (7,8),
       (7,9),
       (7,10),
       (8,9),
       (8,10),
       (9,10),/* типы покрова конфликтуют между собой */
       (13,14),
       (13,15),
       (14,15), /* травоядно, плотоядное, всеядное конфликтуют */
       (16,17), /*слепота и ночное зрение */
       (21,22),
       (21,23), /* Съедобность мяса */
       (22,23),
       (24,25), /* Количество мяса */
       (26,27), /* чистоплотность */
       (29,28),
       (29,30),
       (29,35), /* Неприручаемое конфликтует с приручаемыми */
       (32,33),
       (33,34),
       (32,34); /* разные настроения */

insert into climate(name, description, temp_min_avg, temp_max_avg)
values /* 1 */('Экваториальный климат', 'Для этого типа климата характерно господство жарких и влажных экваториальных воздушных масс. Температура воздуха здесь постоянна (+24–28 °С), в течение года здесь выпадает очень много осадков (от 1500 до 5000 мм). Из-за того, что количество осадков превышает испарение, почвы в экваториальном климате заболочены, на них растут густые и высокие влажные леса. Экваториальный тип климата формируется над северными районами Южной Америки, на побережье Гвинейского залива, над бассейном реки Конго и верховьев Нила в Африке, над большей частью Индонезийского архипелага и прилегающей к нему части Индийского и Тихого океанов в Азии.', 26, 26),
       /* 2 */('Субэкваториальный климат', 'При этом типе климата ежегодно бывают дождливые сезоны – летом здесь жарко и часто выпадают обильные осадки. С приходом зимы
наступает более прохладный и сухой сезон. Осадки в субэкваториальном климате распределяются очень неравномерно. Например, в столице Гвинеи г. Конакри в декабре-марте выпадает
15 мм осадков, а июне-сентябре – 3920 мм. Этот тип климата распространён в некоторых частях Индийского океана, на западе Тихого океана, а также над Южной Азией и в тропиках Африки и
Южной Америки.', 20, 30),
       /* 3 */('Тропический климат', 'В зоне тропического климатического пояса господствуют антициклоны с высоким давлением, и стоит ясная погода почти весь год. Для этого климатического пояса характерны два сезона: тёплый и холодный. Температуры могут колебаться от +20 °С на побережье до +50 °С в глубине материка. Суточное колебание температуры тоже очень значительное: в летнее время днём воздух накаляется до +40–45 °С, ночью же остывает до +10–15 °С. В тропиках часто встречаются пустыни, наиболее крупная из которых — Сахара в Африке. В более
увлажнённых районах распространены саванны и листопадные леса. Тропический климат характерен для Мексики, Северной и Южной Африки, Центральной Австралии, Аравийского полуострова.', 12, 35),
       /* 4 */('Субтропический климат', 'Субтропический климат преобладает в регионах, расположенных между тропическими и умеренными широтами, примерно между 30° и 45° северной и южной широты. Здесь обычно жаркое тропическое лето и достаточно прохладная зима. Средняя месячная температура летом выше +22 °С, зимой выше -3 °C, но из-за вторжений полярного воздуха возможны заморозки до -10 … -15 °С, а изредка и сильные (до -25 °C) морозы. Этот тип климата характерен для Средиземноморья, Южной Африки, Юго-Западной Австралии, Северо-Западной Калифорнии.', 7, 22),
       /* 5 */('Умеренный климат', 'Этот тип климата формируется над умеренными широтами (от 40–45° северной и южной широты до полярных кругов). В Северном полушарии более половины поверхности умеренного пояса занимает суша, в Южном 98% – это океаны. Умеренному климату присущи частые и сильные изменения погоды из-за циклонов. Главная особенность умеренного климата – четыре сезона: два основных – холодный (зима) и тёплый (лето), и два промежуточных – весна и осень. Средняя температура самого холодного месяца, как правило, ниже 0 °C, самого тёплого – выше +15 °C. В умеренном климате зимой на поверхности земли лежит снег. Преобладающие западные ветра приносят осадки в течение всего года, за год выпадает от 1000 мм в прибрежных районах до 100 мм в глубине материка.', -15, 20),
       /* 6 */('Субполярный', '(субарктический/субантарктический) климат. Субарктический климатический пояс расположен между арктическим и умеренным климатическими поясами Северного полушария Земли. Летом здесь господствует умеренная воздушная масса, зимой – арктическая. Лето короткое и холодное – в июле температура воздуха днём редко поднимается выше +15 °С, ночью падает до 0…+3 °С. В течение всего лета не исключены ночные заморозки. Зимой температура воздуха
днём и ночью составляет -35–45 °С. Территория, на которой господствует субарктический климат, занята тундрой и лесотундрой, почвы представляют собой многолетнюю мерзлоту, растения и животные встречаются редко. Субарктический климат распространён на севере России и Канады, на Аляске (США), в Южной Гренландии и на крайнем севере Европы.Субантарктический климатический пояс расположен в Южном полушарии между умеренным и антарктическим поясами. Подавляющая часть субантарктической климатической зоны занята
поверхностью океана. Количество осадков достигает 500 мм в год.', -20, 0),
       /* 7 */('Полярный климат', 'Выше 70° северной и 65° южной широты господствует полярный климат, образующий два пояса: арктический и антарктический. Весь год здесь преобладают полярные воздушные массы. Солнце несколько месяцев не появляется вовсе (это время называется «полярная ночь») и несколько месяцев не уходит за горизонт («полярный день»). Снег и лёд отдают больше тепла, чем его получают, поэтому воздух сильно
охлаждён, снег не тает весь год. В течение всего года здесь высокое атмосферное давление (антициклон), поэтому ветры слабые, облаков
почти нет. Осадков выпадает очень мало, воздух насыщен мелкими ледяными иглами, а летом типична продолжительная морось. Средняя
температура лета не превышает 0 °С, а зимы – -20–40 °С.', -40, 0),
    /* 8 */('Средиземноморский климат', 'считается наиболее комфортным для человека: не слишком жаркое лето (+22–27°С) и тёплая зима', 3, 26),
    /* 9 */('Материковый климат', 'распространён в Северной Америке и Центральной Азии. Температура воздуха летом — около 30°С, а зимой может падать ниже нуля.', -5, 30),
    /* 10 */('Муссонный климат', ' характерен для восточных побережий Азии. Лето здесь жаркое и влажное (до 25°С), а зима умеренная (от 0 до +8°С)', 0, 25),
    /* 11 */('Океанический климат', 'над океанами в субтропиках летом стоит преимущественно сухая и малооблачная погоду, зато зимой циклоны вызывают сильные дожди и штормы', 5, 23);

/*
 Link: https://climate-box.com/ru/textbooks/the-problem-of-climate-change-ru/1-2-%D1%82%D0%B8%D0%BF%D1%8B-%D0%BA%D0%BB%D0%B8%D0%BC%D0%B0%D1%82%D0%BE%D0%B2-%D0%B8-%D0%BA%D0%BB%D0%B8%D0%BC%D0%B0%D1%82%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B5-%D0%BF%D0%BE%D1%8F%D1%81%D0%B0-2/#:~:text=%D0%9E%D1%81%D0%BD%D0%BE%D0%B2%D0%BD%D1%8B%D0%B5%20%D0%BA%D0%BB%D0%B8%D0%BC%D0%B0%D1%82%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B5%20%D0%BF%D0%BE%D1%8F%D1%81%D0%B0%3A%20%D1%8D%D0%BA%D0%B2%D0%B0%D1%82%D0%BE%D1%80%D0%B8%D0%B0%D0%BB%D1%8C%D0%BD%D1%8B%D0%B9%2C%20%D1%82%D1%80%D0%BE%D0%BF%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B9,%D1%85%D0%B0%D1%80%D0%B0%D0%BA%D1%82%D0%B5%D1%80%D0%BD%D1%8B%D0%B5%20%D0%B4%D0%BB%D1%8F%20%D1%8D%D1%82%D0%B8%D1%85%20%D0%BA%D0%BB%D0%B8%D0%BC%D0%B0%D1%82%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D1%85%20%D0%BF%D0%BE%D1%8F%D1%81%D0%BE%D0%B2.
 Примерно то что я и имел ввиду, при желании можно чуть-чуть расширить и добавить подклиматы
 */

insert into animal_class(name)
values  /* 1 */('Ракообразные'),
        /* 2 */('Паукообразные'),
        /* 3 */('Насекомые'),
        /* 4 */('Млекопитающие'),
        /* 5 */('Птицы'),
        /* 6 */('Пресмыкающиеся'),
        /* 7 */('Земноводные'),
        /* 8 */('Рыбы');
/*
 Link: https://shkolnaiapora.ru/okruzhayushhij-mir/vidy-zhivotnyx.html
 */

insert into animal(name, climate_id, animal_class_id)
values  /* 1 */('Рак', 5, 1),
        /* 2 */('Креветка', 4, 1),
        /* 3 */('Краб', 2, 1),
        /* 4 */('Птицеед', 3, 2),
        /* 5 */('Клещ лесной', 5, 2),
        /* 6 */('Сенокосец', 5, 2),
        /* 7 */('Муха', 5, 3),
        /* 8 */('Сколопендра', 4, 3),
        /* 9 */('Жук-олень', 3, 3),
        /* 10 */('Свинья', 5, 4),
        /* 11 */('Гиппопотам', 1, 4),
        /* 12 */('Каракал', 4, 4),
        /* 13 */('Волк', 5, 4),
        /* 14 */('Дельфин', 3, 4),
        /* 15 */('Шимпанзе', 2, 4),
        /* 16 */('Сова', 7, 5),
        /* 17 */('Голубь', 5, 5),
        /* 18 */('Фламинго', 4, 5),
        /* 19 */('Аллигатор', 2, 6),
        /* 20 */('Комодо', 2, 6),
        /* 21 */('Черепаха', 3, 6),
        /* 22 */('Жаба', 4, 7),
        /* 23 */('Лягушка', 5, 7),
        /* 24 */('Аксолотль', 4, 7),
        /* 25 */('Язь', 5, 8),
        /* 26 */('Рыба-клоун', 2, 8),
        /* 27 */('Акула', 3, 8);


/*
 Климат ставил почти рандомно, возможно стоит от него избавиться
 Каждого класса как минимум по 3 животных
 */

insert into reserve(name, description, climate_id)
values ('Крюгер', 'Мало что может сравниться с магией и великолепием африканской дикой природы. Вряд ли любой другой национальный парк в мире с точки зрения своей нетронутой сельской местности, дикой живой природы и обширность области может сравниться с заповедником Крюгера в ЮАР.', 1),
       ('Какаду', 'Заповедник простирается более чем на 3,2 миллиона акров и включает несколько территорий традиционного проживания коренных народов континента. Чудесные реки South Alligator, прибрежные пляжи, тропические леса и муссонные ветра делают национальный заповедник Какаду желанным местом для посещения.', 2),
       ('Тикаль', 'Путешествие в национальный парк Тикаль — это, прежде всего, средство для изучения наследия майя. Расположенный в диких джунглях, Тикаль скрывает фантастические руины поселений майя, которые датируются примерно 250-900 н.э. Даже то, что осталось с тех времен, поражает воображение туристов удивительной архитектурой храмов и разнообразием различных диких животных. Тикаль — место для удивительных приключений и незабываемых впечатлений.', 3),
       ('Жёлтый дракон', 'Осадок кальция создает здесь иллюзию золота, который и дал название этому месту — «Жёлтый дракон». Также этот заповедник является домом для милой, известной всему миру панды — символу WWF.', 4),
       ('Таганай', 'Таганай – это километры тайги, это горные хребты и каменные реки, это альпийские луга и горная тундра. Таганай – это состояние души, место, куда хочется возвращаться снова и снова. Таганай - это маршруты для туристов с любым уровнем подготовки, от однодневного похода на Чёрную Скалу, откуда открывается невероятная панорама на хребты Большого Таганая, до многодневных восхождений на вершины Юрмы, Ицыла, путешествия в Долину Сказок. Таганай - это уникальная возможность за один раз увидеть типичные ландшафты горного Урала, побывать в разных климатических поясах, отдохнуть на берегу быстрой горной реки и спуститься в копи.', 5),
       ('Сагармахта', 'Высоко и величественно расположенный в Гималаях, непальский заповедник Сагарматха включает три из десяти самых высоких гор в мире, в том числе Эверест. Бесконечные ледники, захватывающие дух долины с нетронутым снегом делают природный парк Сагарматха частью Всемирного наследия ЮНЕСКО. И, конечно, для любителей живой природы не посетить этот высокогорный заповедник — значит потерять что-то важное.', 6),
       ('Врангель', 'Самый северный заповедник России, остров Врангеля расположен выше 71° северной широты, всего на 19° южнее Северного полюса. Его уникальные ландшафты арктической тундры с её вечной мерзлотой и минимальным количеством растительности ежегодно привлекают массы любителей природы со всего света. Отличительная особенность заповедника «Остров Врангеля» — стратегическое положение в непосредственной близости от Берингова пролива. Некогда Северная Америка и Евразия были связаны здесь полоской суши, а после поднятия уровня мирового океана острова пролива оказались изолированы от континентов, и жизнь развивалась здесь по своим законам. В результате этого сегодня в заповеднике обитают около 40 эндемичных видов, не встречающихся более нигде на планете.', 7),
       ('Средиземье', 'Заповедник с материковым климатом', 8),
       ('Нарния', 'Заповедник с муссонным климатом', 9),
       ('Мордор', 'Заповедник со океанический климатом', 10),
       ('Киберпанк', 'Заповедник со средиземноморским климатом', 11);
/*
 link: https://blog.ostrovok.ru/top-10-nacionalnyx-zapovednikov-mira/
 https://tonkosti.ru/%D0%97%D0%B0%D0%BF%D0%BE%D0%B2%D0%B5%D0%B4%D0%BD%D0%B8%D0%BA%D0%B8_%D0%90%D1%80%D0%BA%D1%82%D0%B8%D0%BA%D0%B8
 https://vk.com/fgby_np_taganay

 Один заповедник на каждый климат
 */

insert into reserve_worker(reserve_id, worker_id, available_load)
values (1,5,3),
       (2,6,3),
       (3,7,4),
       (4,8,3),
       (5,9,4),
       (6,10,5),
       (7,11,6),
       (1,12,1),
       (2,13,1),
       (3,14,2),
       (4,15,1),
       (5,16,3),
       (6,17,2),
       (7,18,1);

insert into animal_characteristic(animal_id, characteristic_id)
values        (1, 4),
       (1, 20),
       (1, 21),
       (1, 25),
       (1, 28),
       (1, 33),
       (1, 15);
insert into animal_characteristic(animal_id, characteristic_id)
values        (2, 5),
       (2, 20),
       (2, 23),
       (2, 24),
       (2, 28),
       (2, 33),
       (2, 15);
insert into animal_characteristic(animal_id, characteristic_id)
values        (3, 4),
       (3, 20),
       (3, 23),
       (3, 25),
       (3, 29),
       (3, 32),
       (3, 15);
insert into animal_characteristic(animal_id, characteristic_id)
values        (4, 4),
       (4, 6),
       (4, 13),
       (4, 31),
       (4, 32),
       (4, 29),
       (4, 22),
       (4, 36);
insert into animal_characteristic(animal_id, characteristic_id)
values        (5, 5),
       (5, 36),
       (5, 13),
       (5, 32);
insert into animal_characteristic(animal_id, characteristic_id)
values        (6, 5),
       (6, 8),
       (6, 14),
       (6, 33),
       (6, 29);
insert into animal_characteristic(animal_id, characteristic_id)
values        (7, 5),
       (7, 37),
       (7, 29),
       (7, 26),
       (7, 15);
insert into animal_characteristic(animal_id, characteristic_id)
values        (8, 5),
       (8, 7),
       (8, 13),
       (8, 19),
       (8, 29),
       (8, 36);
insert into animal_characteristic(animal_id, characteristic_id)
values        (9, 4),
       (9, 7),
       (9, 14),
       (9, 20),
       (9, 29),
       (9, 31),
       (9, 34);
insert into animal_characteristic(animal_id, characteristic_id)
values        (10, 2),
       (10, 8),
       (10, 12),
       (10, 14),
       (10, 23),
       (10, 24),
       (10, 26),
       (10, 31),
       (10, 34);
insert into animal_characteristic(animal_id, characteristic_id)
values        (11, 1),
       (11, 8),
       (11, 11),
       (11, 14),
       (11, 22),
       (11, 27),
       (11, 29),
       (11, 32);
insert into animal_characteristic(animal_id, characteristic_id)
values        (12, 3),
       (12, 6),
       (12, 13),
       (12, 16),
       (12, 18),
       (12, 27),
       (12, 29),
       (12, 39),
       (12, 32);
insert into animal_characteristic(animal_id, characteristic_id)
values        (13, 3),
       (13, 6),
       (13, 13),
       (13, 16),
       (13, 29),
       (13, 32),
       (13, 39);
insert into animal_characteristic(animal_id, characteristic_id)
values        (14, 2),
       (14, 8),
       (14, 12),
       (14, 13),
       (14, 28),
       (14, 30),
       (14, 34),
       (14, 38),
       (14, 39);
insert into animal_characteristic(animal_id, characteristic_id)
values        (15, 3),
       (15, 6),
       (15, 39),
       (15, 15),
       (15, 26),
       (15, 39),
       (15, 32);
insert into animal_characteristic(animal_id, characteristic_id)
values        (16, 3),
       (16, 9),
       (16, 13),
       (16, 16),
       (16, 18),
       (16, 28),
       (16, 34),
       (16, 37);
insert into animal_characteristic(animal_id, characteristic_id)
values        (17, 3),
       (17, 9),
       (17, 15),
       (17, 22),
       (17, 26),
       (17, 30),
       (17, 31),
       (17, 33),
       (17, 37);
insert into animal_characteristic(animal_id, characteristic_id)
values        (18, 3),
       (18, 9),
       (18, 14),
       (18, 27),
       (18, 29),
       (18, 37);
insert into animal_characteristic(animal_id, characteristic_id)
values        (19, 2),
       (19, 10),
       (19, 11),
       (19, 13),
       (19, 26),
       (19, 29),
       (19, 32),
       (19, 38);
insert into animal_characteristic(animal_id, characteristic_id)
values        (20, 3),
       (20, 10),
       (20, 15),
       (20, 29),
       (20, 32);
insert into animal_characteristic(animal_id, characteristic_id)
values        (21, 3),
       (21, 10),
       (21, 14),
       (21, 20),
       (21, 27),
       (21, 34),
       (21, 38);
insert into animal_characteristic(animal_id, characteristic_id)
values        (22, 4),
       (22, 8),
       (22, 11),
       (22, 14),
       (22, 26),
       (22, 34),
       (22, 38);
insert into animal_characteristic(animal_id, characteristic_id)
values        (23, 4),
       (23, 8),
       (23, 14),
       (23, 27),
       (23, 33),
       (23, 38);
insert into animal_characteristic(animal_id, characteristic_id)
values        (24, 4),
       (24, 8),
       (24, 14),
       (24, 31),
       (24, 33),
       (24, 38);
insert into animal_characteristic(animal_id, characteristic_id)
values        (25, 3),
       (25, 10),
       (25, 12),
       (25, 13),
       (25, 21),
       (25, 24),
       (25, 26),
       (25, 28),
       (25, 34),
       (25, 38);
insert into animal_characteristic(animal_id, characteristic_id)
values        (26, 4),
       (26, 10),
       (26, 14),
       (26, 22),
       (26, 27),
       (26, 33),
       (26, 38);
insert into animal_characteristic(animal_id, characteristic_id)
values        (27, 2),
       (27, 8),
       (27, 11),
       (27, 13),
       (27, 19),
       (27, 22),
       (27, 29),
       (27, 32),
       (27, 38);

insert into experiment(status_id, created_animal_id, experimenter_id)
values (2, null, 3),
       (1, null, 1),
       (1, null, 2),
       (3, null, 4);


insert into animal_in_experiment
values (1, 11),
       (1, 12),
       (1, 13),
       (1, 14),
       (1, 15);

insert into animal_in_experiment
values (2, 10),
       (2, 11);

insert into animal_in_experiment
values (3, 1),
       (3, 2),
       (3, 3);

insert into animal_in_experiment
values (4, 1),
       (4, 2),
       (4, 3);

insert into chosen_characteristic(experiment_id, characteristic_id)
values        (1, 1),
       (1, 6),
       (1, 14),
       (1, 16),
       (1, 27),
       (1, 28),
       (1, 30),
       (1, 34),
       (1, 38),
       (1, 39);
insert into chosen_characteristic(experiment_id, characteristic_id)
values        (2, 1),
       (2, 12),
       (2, 14),
       (2, 23),
       (2, 24),
       (2, 27),
       (2, 31),
       (2, 34);
insert into chosen_characteristic(experiment_id, characteristic_id)
values        (3, 4),
       (3, 15),
       (3, 23),
       (3, 24),
       (3, 28);
insert into chosen_characteristic(experiment_id, characteristic_id)
values        (4, 4),
              (4, 15),
              (4, 23),
              (4, 24),
              (4, 28);

insert into animal(name, is_artificial, climate_id, animal_class_id)
values (generate_default_animal_name(2), true, null, 4),
       (generate_default_animal_name(3), true, null, 1),
       (generate_mutated_animal_name(4), true, null, 1);

update experiment
set created_animal_id = 28
where id = 2;

update experiment
set created_animal_id = 29
where id = 3;

update experiment
set created_animal_id = 30
where id = 4;

insert into animal_characteristic(animal_id, characteristic_id)
values        (28, 1),
       (28, 12),
       (28, 14),
       (28, 23),
       (28, 24),
       (28, 27),
       (28, 31),
       (28, 34);
insert into animal_characteristic(animal_id, characteristic_id)
values        (29, 4),
       (29, 15),
       (29, 23),
       (29, 24),
       (29, 28);
insert into animal_characteristic(animal_id, characteristic_id)
values        (30, 3),
       (30, 13),
       (30, 22),
       (30, 26),
       (30, 31),
       (30, 32);

insert into animal_reserve(animal_id, reserve_id)
values (28, 1),
       (28, 2),
       (28, 3),
       (29, 4),
       (29, 5),
       (29, 6),
       (30, 5),
       (30, 6),
       (30, 7);

insert into report(animal_id, reserve_id, health_rate, report_date, reporter_id)
values     (28, 1, 1, CURRENT_DATE+1, 5),
    (28, 1, 2, CURRENT_DATE+2, 5),
    (28, 1, 5, CURRENT_DATE+3, 5),
    (28, 1, 4, CURRENT_DATE+4, 5),
    (28, 1, 4, CURRENT_DATE+5, 5),
    (28, 2, 3, CURRENT_DATE+1, 6),
    (28, 2, 4, CURRENT_DATE+2, 6),
    (28, 2, 4, CURRENT_DATE+3, 6),
    (28, 2, 4, CURRENT_DATE+4, 6),
    (28, 2, 4, CURRENT_DATE+5, 6),
    (28, 3, 4, CURRENT_DATE+1, 7),
    (28, 3, 1, CURRENT_DATE+2, 7),
    (28, 3, 5, CURRENT_DATE+3, 7),
    (28, 3, 5, CURRENT_DATE+4, 7),
    (28, 3, 4, CURRENT_DATE+5, 7);
insert into report(animal_id, reserve_id, health_rate, report_date, reporter_id)
values     (29, 4, 3, CURRENT_DATE+1, 8),
    (29, 4, 1, CURRENT_DATE+2, 8),
    (29, 4, 3, CURRENT_DATE+3, 8),
    (29, 4, 4, CURRENT_DATE+4, 8),
    (29, 4, 1, CURRENT_DATE+5, 8),
    (29, 5, 5, CURRENT_DATE+1, 9),
    (29, 5, 4, CURRENT_DATE+2, 9),
    (29, 5, 3, CURRENT_DATE+3, 9),
    (29, 5, 5, CURRENT_DATE+4, 9),
    (29, 5, 2, CURRENT_DATE+5, 9),
    (29, 6, 4, CURRENT_DATE+1, 10),
    (29, 6, 2, CURRENT_DATE+2, 10),
    (29, 6, 5, CURRENT_DATE+3, 10),
    (29, 6, 5, CURRENT_DATE+4, 10),
    (29, 6, 4, CURRENT_DATE+5, 10);
insert into report(animal_id, reserve_id, health_rate, report_date, reporter_id)
values     (30, 5, 1, CURRENT_DATE+1, 9),
    (30, 5, 5, CURRENT_DATE+2, 9),
    (30, 5, 1, CURRENT_DATE+3, 9),
    (30, 5, 4, CURRENT_DATE+4, 9),
    (30, 5, 5, CURRENT_DATE+5, 9),
    (30, 6, 4, CURRENT_DATE+1, 10),
    (30, 6, 2, CURRENT_DATE+2, 10),
    (30, 6, 5, CURRENT_DATE+3, 10),
    (30, 6, 2, CURRENT_DATE+4, 10),
    (30, 6, 3, CURRENT_DATE+5, 10),
    (30, 7, 4, CURRENT_DATE+1, 11),
    (30, 7, 4, CURRENT_DATE+2, 11),
    (30, 7, 4, CURRENT_DATE+3, 11),
    (30, 7, 3, CURRENT_DATE+4, 11),
    (30, 7, 4, CURRENT_DATE+5, 11);

